[lang-zh-Hant]
使用IJKL滚轮移动滚轮，比RF多一个横轴。 =使用IJKL滾輪移動滾輪，比RF多一個橫軸。
使用 Win+Alt+H 快速启动讯飞语音悬浮窗（默认启用） =使用 Win+Alt+H 快速啟動訊飛語音懸浮窗（默認啟用）
HJKL光标加速度比率, 默认为 1, 你想慢点就改成 0.5 之类 =HJKL光標加速度比率，默認為 1，你想慢點就改成 0.5 之類
CLX BrainStorm 的功能激活碼，填FREE使用免費版本 =CLX BrainStorm 的功能激活碼，填FREE使用免費版本
Brainstorm 上次提问 =頭腦風暴 上次提問
U:PageDown I:PageUP 翻页速率 =U:下一頁 I:上一頁 翻頁速率
Tab速率 =標籤速率
使用 SendInput 方法提高模拟鼠标点击、移动性能 =使用 SendInput 方法提高模擬滑鼠點擊、移動性能
禁用模拟鼠标模块 =停用模擬滑鼠模組
启用自动粘附各种按钮，编辑框 =啟用自動黏附各種按鈕、編輯框。
使用 Windows API 强势提升模拟鼠标滚轮性能（目前有bug不建议启用） =使用 Windows API 強勢提升模擬滑鼠移動性能
右手 \][ 模拟Windows键和 Alt + Tab， 具体用法参见LaptopKeyboardFix 模块说明，默认启用 = 右手 \][ 模擬Windows鍵和 Alt + Tab，具體用法參見LaptopKeyboardFix模組說明，默認啟用
撞上屏幕边界后停止加速 = 撞上螢幕邊界後停止加速
是否根据屏幕 DPI 比率缩放鼠标速度 = 是否根據螢幕 DPI 比率縮放滑鼠速度
滚轮加速度比率, 默认为 1, 你想慢点就改成 0.5 之类 =滾輪加速度比率，默認為 1，你想慢點就改成 0.5 之類
鼠标加速度比率, 默认为 1, 你想慢点就改成 0.5 之类 =滑鼠加速度比率，默認為 1，你想慢點就改成 0.5 之類
使用 Windows API 强势提升模拟鼠标移动性能 = 使用 Windows API 強勢提升模擬滑鼠移動性能
CapsLockX 载入成功 = CapsLockX 載入成功
启动时显示配置窗口 = 啟動時顯示配置窗口
首次启动？若想重新进入首次使用教学，请改为 1 并保存，然后使用 Ctrl+Alt+\ 重载 CapsLockX。 = 首次啟動？若想重新進入首次使用教學，請改為 1 並保存，然後使用 Ctrl+Alt+\ 重載 CapsLockX。
Reload CapsLockX =重新加載CapsLockX
Edit config.ini = 編輯 config.ini
Exit CapsLockX = 退出CapsLockX
模块帮助有变更 = 模組幫助有變更
警告：模块帮助未能稳定更新，如果你看到了这个消息，请联系雪星（QQ:997596439, 邮箱： snomiao@gmail.com） = 警告：模組幫助未能穩定更新，如果你看到了這個消息，請聯繫雪星（QQ:997596439, 郵箱： snomiao@gmail.com）
加载模块帮助： = 加載模組幫助：
跳过模块： = 「跳過模組：」
运行模块： = 「運行模組：」
请勿直接编辑本文件，以下内容由核心加载器自动生成。雪星/(20210318) = 請勿直接編輯本文件，以下內容由核心加載器自動生成。雪星/(20210318)
Unable to write ModulesRunner.ahk, if you are install with chocolatey, run me as admin at the first time please. = 無法寫入 ModulesRunner.ahk，如果您是使用 chocolatey 安裝的，請在第一次運行時以管理員身份運行我。
注意：未能写入模块运行器，如果使用 chocolatey 首次安装后，请以管理员权限运行。 = 注意：未能寫入模組運行器，如果使用 chocolatey 首次安裝後，請以管理員權限運行。
加载模块帮助遇到错误。 = 加載模組幫助遇到錯誤。
已为你打开 CapsLockX 主页，请手动更新 CapsLockX = 已為你打開 CapsLockX 主頁，請手動更新 CapsLockX
CapsLockX 错误 = CapsLockX 錯誤
CapsLockX 异常退出，是否重载？ = CapsLockX 異常退出，是否重載？
CapsLockX 退出 = CapsLockX 退出
CapsLockX 已退出。 = CapsLockX 已退出。
Anki导入 = Anki匯入
获取到 = 「獲取到」
没有获取到剪贴板的内容 = 沒有獲取到剪貼板的內容
错误 = 「錯誤」
未找到OneNote窗口 = 未找到 OneNote 視窗
Switch to diary tab = 切換到日記標籤
Wait for title change after switching tabs = 「切換標籤後等待標題更改」
Navigate to end of notebook = 導航到筆記本的末尾
Wait for title change after navigation = “導航後等待標題更改”
搜索结果窗口不正确 = 「搜索結果窗口不正確」
条笔记链接已复制 = 條筆記鏈接已複製
OneNote 内容未能复制成功，5秒内按 Ctrl + C 可手动复制并尝试继续流程 = OneNote 內容未能複製成功，5秒內按 Ctrl + C 可手動複製並嘗試繼續流程
OneNote 内容未能复制成功 = OneNote 內容未能複製成功
超时未按下Alt键 = 超時未按下Alt鍵
超时未放开Alt键 = 超時未放開Alt鍵
复制失败 = 「複製失敗」
你似乎还没有安装讯飞语音输入法，是否现在下载安装包并【手动安装】到默认目录？ - [讯飞输入法官网 - 更好用的手机输入法，提供专业输入法定制解决方案！]( https://srf.xunfei.cn/\#/ ) = 你似乎還沒有安裝訊飛語音輸入法，是否現在下載安裝包並【手動安裝】到默認目錄？ - [訊飛輸入法官網 - 更好用的手機輸入法，提供專業輸入法定制解決方案！]( https://srf.xunfei.cn/\#/ )
訪問官方網站来取得激活碼，在此輸入，或者填 FREE 使用免費版，網址如下： = 訪問官方網站來取得激活碼，在此輸入，或者填 FREE 使用免費版，網址如下：
激活碼輸入 = 「激活碼輸入」
回邮件：选中一段邮件，输入 >> Reply this email = 回郵件：選中一段郵件，輸入 >> Reply this email
翻译：选中一段文字，输入 >> Translate to English/翻译到繁体中文/简体中文 = 翻譯：選中一段文字，輸入 >> Translate to English/翻譯到繁體中文/簡體中文
总结：选中一段文字，输入 >> Summary = 總結：選中一段文字，輸入 >> Summary
提问：选中一段文字，输入 >> Question = 提問：選中一段文字，輸入 >> Question
以下为提問内容 = 「」以下為提問內容「」
请輸入文本指令 = 「請輸入文本指令」
Going to Ask AI = 「去問 AI」
Asking AI = 「詢問 AI」
Ready to Ask AI = 準備好詢問 AI 了嗎
请检查激活码是否正确 = 「請檢查啟動碼是否正確」
请等待一段时间后再试 = 請等待一段時間後再試
Unknown Error = 「未知錯誤」
Fail to ask ai = 「無法詢問 AI」
Waiting Answer... = 等待回覆...
Chat streaming stopped, Copied to Clipboard, Press [ESC] to hide. = 聊天串流已停止，已複製到剪貼簿，按 [ESC] 隱藏。
Copied to Clipboard, Press [ESC] to hide. = 已複製到剪貼簿，按 [ESC] 鍵隱藏。
Press [ESC] to stop. = 按 [ESC] 鍵停止。
EvalJS 模块 = EvalJS 模組
正在启动 NodeJS 筆記服務... = 正在啟動 NodeJS 筆記服務...
NodeJS 服务已启动。 = NodeJS 服務已啟動。
执行失败，未能写入脚本文件 = 執行失敗，未能寫入腳本文件
暂停 = 「暫停」
CapsLockX 已暂停 = CapsLockX 已暫停
CapsLockX 已恢复 = CapsLockX 已恢復
CapsLockX 重载模块 = 「CapsLockX 重載模組」
检测到配置更改，是否软重载？ = 檢測到配置更改，是否軟重載？
检测到配置更改，正在自动软重载。 = 檢測到配置更改，正在自動軟重載。
检测到配置更改，正在自动重载。 = 檢測到配置更改，正在自動重載。
检测到配置更改，是否重载？ = 檢測到配置更改，是否重載？
已在Startup文件夹添加CLX的开机自启动，请确认。 = 已在Startup資料夾添加CLX的開機自啟動，請確認。
你可以按 'CapsLockX +, ' （CLX+逗号） 打开此窗口 = 「你可以按 'CapsLockX +, ' （CLX+逗號） 打開此窗口」
当前配置目录： = 「」當前配置目錄：「」
CLX脚本交流群： QQ群 100949388 、 Telegram 群 https://t.me/capslockx 、微信群: 添加 @snomiao 拉你 = CLX腳本交流群： QQ群 100949388 、 Telegram 群 https://t.me/capslockx 、微信群: 添加 @snomiao 拉你
版本 = 「」版本「」
作者: 雪星 ( Snowstar Miao <snomiao@gmail.com> ) = 作者: 雪星 ( Snowstar Miao <snomiao@gmail.com> )
确定 = 「確定」
切换語言 = 切換語言
打开BUG反馈与建议页面 = 打開BUG反饋與建議頁面
打开官方文档 = 「打開官方文件」
添加开机自动启动 = 添加開機自動啟動
取消开机自动启动 = 取消開機自動啟動
配置文件编辑 = 「配置文件編輯」
重新載入CapsLockX = “重新載入CapsLockX”
启用番茄时钟，每25分钟休息5分钟·。 = 啟用番茄時鐘，每25分鐘休息5分鐘。
使用 CapsLock 作为引导键（默认启用） = 「使用 CapsLock 作為引導鍵（默認啟用）」
使用 Space 作为引导键（默认启用） = 「使用 Space 作為引導鍵（默認啟用）」
请求管理员权限（权限受限时，鼠标模拟等功能无法正常运行，如果不需要管理权限下的功能，可以改为0） = 請求管理員權限（權限受限時，滑鼠模擬等功能無法正常運行，如果不需要管理權限下的功能，可以改為0）
使用番茄时钟（默认禁用，改为 1 开启） = 使用番茄時鐘（默認禁用，改為 1 開啟）
使用 Space 作为引导键（默认启用，用户启用） = 「使用 Space 作為引導鍵（默認啟用，使用者啟用）」
使用 CapsLock 作为引导键（默认启用，用户启用） = 使用 CapsLock 作為引導鍵（默認啟用，用戶啟用）
Choose your language, default option is auto = 選擇你的語言，默認選項是自動
For example: zh,ja,en,fr,es,ar...' = 「例如：zh、ja、en、fr、es、ar...」
Change Language of CapsLockX = 更改 CapsLockX 的語言
开始编辑用户脚本： = 「」開始編輯用戶腳本：「」
切换到桌面： = 切換到桌面：
在CLX+Z窗口切换时记住还原鼠标在每个窗口中的位置 =在CLX+Z窗口切換時記住還原滑鼠在每個窗口中的位置
双击 LCtrl LAlt LShift 来最后置当前窗口（主要用于虚拟机和远程桌面） = 雙擊 LCtrl LAlt LShift 來最後置當前窗口（主要用於虛擬機和遠程桌面）
最近1分钟内闪动窗口激活 = 「最近1分鐘內閃動窗口激活」
启用雪星并击（实验中），使用单手操作整个主键区 = 啟用雪星並擊（實驗中），使用單手操作整個主鍵區
启动时报告番茄状态 = 啟動時報告番茄狀態
使用番茄报时（00分和30分播放工作铃声，每小时的25分和55分播放休息铃声）（需要先开启番茄时钟） = 使用番茄報時（00分和30分播放工作鈴聲，每小時的25分和55分播放休息鈴聲）（需要先開啟番茄時鐘）
使用番茄报时时，自动切换桌面（休息为桌面1，工作为桌面2） = 使用番茄報時時，自動切換桌面（休息為桌面1，工作為桌面2）
已经配置过高精度时间的Flag = 「已經配置過高精度時間的Flag」
番茄时钟： = 「番茄時鐘：」
工作时间到啦！ = 工作時間到啦！
起来运动一下收拾收拾东西！ = 起來運動一下收拾收拾東西！
按 Win + L 锁定电脑时，立即关闭屏幕，默认不启用，你可以按 Win+Alt+L 达到该效果 = 按 Win + L 鎖定電腦時，立即關閉屏幕，默認不啟用，你可以按 Win+Alt+L 達到該效果
加载成功 = 「加載成功」
CapsLockX 重载中 = 「CapsLockX 重載中」
当前語言 = 「」當前語言「」
Creating TODAY-NOTE = 創建今日筆記
'版本'="版本"
'切换語言'="版本"
'Current Language is: '='目前語言是：'
右手 \\][ 模拟Windows键和 Alt + Tab， 具体用法参见LaptopKeyboardFix 模块说明，默认启用=右手 \\][ 模擬Windows鍵和 Alt + Tab，具體用法參見LaptopKeyboardFix 模組說明，預設啟用
首次启动？若想重新进入首次使用教学，请改为 1 并保存，然后使用 Ctrl+Alt+\\ 重载 CapsLockX。=首次啟動？若想重新進入首次使用教學，請改為 1 並保存，然後使用 Ctrl+Alt+\\ 重載 CapsLockX。
你似乎还没有安装讯飞语音输入法，是否现在下载安装包并【手动安装】到默认目录？ - [讯飞输入法官网 - 更好用的手机输入法，提供专业输入法定制解决方案！]( https://srf.xunfei.cn/#/ )=您似乎還沒有安裝訊飛語音輸入法，是否現在下載安裝包並【手動安裝】到默認目錄？ - [訊飛輸入法官網 - 更好用的手機輸入法，提供專業輸入法定制解決方案！](https://srf.xunfei.cn/#/)
# 帮助模块\n\n如果你想学习如何开发 CapsLockX 的插件，请：\n\n1. 打开 `Modules/@Help.ahk` ， 你可以了解到 CapsLockX 插件的基本格式\n2. 将它复制一份，命名为你自己的插件名称\n3. 将它本来的功能改成你自己需要的功能，插件的开发就完成啦！\n\n## 本模块功能见下\n\n| 作用于 | 按键                  | 功能                             |\n| ------ | --------------------- | -------------------------------- |\n| 全局   | CapsLockX + /         | 临时显示热键提示                 |\n| 全局   | CapsLockX + Alt + /   | 🔗 打开 CapsLockX 的完整文档页面 |\n| 全局   | CapsLockX + Shift + / | 🕷 提交 bug、建议等               |=```\n# 幫助模組\n\n如果你想學習如何開發 CapsLockX 的外掛，請：\n\n1. 打開 `Modules/@Help.ahk` ，你可以了解到 CapsLockX 外掛的基本格式\n2. 將它複製一份，命名為你自己的外掛名稱\n3. 將它本來的功能改成你自己需要的功能，外掛的開發就完成啦！\n\n## 本模組功能見下\n\n| 作用於 | 按鍵                  | 功能                             |\n| ------ | --------------------- | -------------------------------- |\n| 全局   | CapsLockX + /         | 臨時顯示熱鍵提示                 |\n| 全局   | CapsLockX + Alt + /   | 🔗 打開 CapsLockX 的完整文檔頁面 |\n| 全局   | CapsLockX + Shift + / | 🕷 提交 bug、建議等               |\n```
# 讯飞输入法悬浮窗插件\n\n## 用法\n\n| 作用于 |     按键      | 功能说明              |\n| ------ | :-----------: | --------------------- |\n| 全局   | Win + Alt + H | 启动/切换讯飞语音输入 |\n\n## 注\n\n1. 若没有安装讯飞语音则会自动询问是否引导下载安装\n\n## 效果如下图\n\n![App-讯飞语音输入法悬浮窗演示.gif](./docs/media/App-讯飞语音输入法悬浮窗演示.gif)=# 讯飞輸入法懸浮窗插件\n\n## 用法\n\n| 作用於 |     按鍵      | 功能說明              |\n| ------ | :-----------: | --------------------- |\n| 全局   | Win + Alt + H | 啟動/切換訊飛語音輸入 |\n\n## 注\n\n1. 若沒有安裝訊飛語音則會自動詢問是否引導下載安裝\n\n## 效果如下圖\n\n![App-讯飞语音输入法悬浮窗演示.gif](./docs/media/App-讯飞语音输入法悬浮窗演示.gif)
# Anki 增强模块\n\nAnki 操作增强\n\n## 常用功能/特性\n\n1. 使用 WASD 或 HJKL 来快速连续地（并且可以撤销）切换记忆卡片\n2. 在 Excel 制作一个单词列表，共 2 列， 全选复制，然后在 Anki 中按 Alt + i 来快速导入单词列表。\n3. 简化 4 个选项为 3 个方向键，左易，下中，右难，上撤销。\n4. 可配合手柄使用，使用 XPadder 配置手柄摇杆映射到方向键即可。效果请见 bilibili [中二雪星怎背词 - 手柄怎么可以不用来背单词！](https://www.bilibili.com/video/av8456838/)\n\n## 说明\n\n| 模式                 | Anki 增强模块  | 说明                                                        |\n| -------------------- | :------------: | ----------------------------------------------------------- |\n| 在 Anki-学习界面     | `w 或 k 或 ↑`  | 按下\e撤销，松开显示答案                                     |\n| 在 Anki-学习界面     | `a 或 h 或 ←`  | 按下\e顺利，松开显示答案                                     |\n| 在 Anki-学习界面     | `s 或 j 或 ↓`  | 按下\e一般，松开显示答案                                     |\n| 在 Anki-学习界面     | `d 或 l 或 →`  | 按下\e生疏，松开显示答案                                     |\n| 在 Anki-学习界面     |      `q`       | 返回上个界面                                                |\n| 在 Anki-学习界面     |      `c`       | 添加新卡片                                                  |\n| 在 Anki-学习界面     | `1 或 NumPad1` | 困难（原键位）                                              |\n| 在 Anki-学习界面     | `2 或 NumPad2` | 生疏（原键位）                                              |\n| 在 Anki-学习界面     | `3 或 NumPad3` | 一般（原键位）                                              |\n| 在 Anki-学习界面     | `4 或 NumPad4` | 顺利（原键位）                                              |\n| 在 Anki-学习界面     | `5 或 NumPad5` | 撤销                                                        |\n| 在 Anki-学习界面     | `6 或 NumPad6` | 暂停卡片                                                    |\n| 在 Anki-学习界面     |   `Alt + i`    | 快速导入剪贴版的内容（按 Tab 分割） / 比如可以从 Excel 复制 |\n| 在 Anki-添加卡片界面 |   `Alt + s`    | 按下 添加 按钮                                              |=# Anki 增強模塊\n\nAnki 操作增強\n\n## 常用功能/特性\n\n1. 使用 WASD 或 HJKL 來快速連續地（並且可以撤銷）切換記憶卡片\n2. 在 Excel 製作一個單詞列表，共 2 列， 全選複製，然後在 Anki 中按 Alt + i 來快速導入單詞列表。\n3. 簡化 4 個選項為 3 個方向鍵，左易，下中，右難，上撤銷。\n4. 可配合手柄使用，使用 XPadder 配置手柄搖桿映射到方向鍵即可。效果請見 bilibili [中二雪星怎背詞 - 手柄怎麼可以不用來背單詞！](https://www.bilibili.com/video/av8456838/)\n\n## 說明\n\n| 模式                 | Anki 增強模塊  | 說明                                                        |\n| -------------------- | :------------: | ----------------------------------------------------------- |\n| 在 Anki-學習界面     | `w 或 k 或 ↑`  | 按下\e撤銷，松開顯示答案                                     |\n| 在 Anki-學習界面     | `a 或 h 或 ←`  | 按下\e順利，松開顯示答案                                     |\n| 在 Anki-學習界面     | `s 或 j 或 ↓`  | 按下\e一般，松開顯示答案                                     |\n| 在 Anki-學習界面     | `d 或 l 或 →`  | 按下\e生疏，松開顯示答案                                     |\n| 在 Anki-學習界面     |      `q`       | 返回上個界面                                                |\n| 在 Anki-學習界面     |      `c`       | 添加新卡片                                                  |\n| 在 Anki-學習界面     | `1 或 NumPad1` | 困難（原鍵位）                                              |\n| 在 Anki-學習界面     | `2 或 NumPad2` | 生疏（原鍵位）                                              |\n| 在 Anki-學習界面     | `3 或 NumPad3` | 一般（原鍵位）                                              |\n| 在 Anki-學習界面     | `4 或 NumPad4` | 順利（原鍵位）                                              |\n| 在 Anki-學習界面     | `5 或 NumPad5` | 撤銷                                                        |\n| 在 Anki-學習界面     | `6 或 NumPad6` | 暫停卡片                                                    |\n| 在 Anki-學習界面     |   `Alt + i`    | 快速導入剪貼版的內容（按 Tab 分割） / 比如可以從 Excel 複製 |\n| 在 Anki-添加卡片界面 |   `Alt + s`    | 按下 添加 按鈕                                              |
# CLX - Brainstorm 大脳风暴\n\n任何時間，任何輸入框，按下 `CLX+b` 鍵，開始使用 AI 輔助輸入。\n\n## 按键分布（开发中）\n\n| 按键描述        | 作用                                                 | 备注 |\n| --------------- | ---------------------------------------------------- | ---- |\n| CLX + b         | 自動複製当前选中内容，輸入指令，让 AI 辅助你的輸入   |      |\n| CLX + Alt + b   | 配置激活碼（目前只有免費方案，将来可能加入功能増強） |      |\n| CLX + Shift + b | 査看使用額度                                         |      |\n\n## Protips:\n\n### 随時整理会議記録\n\n1. 任何輸入框内，使用 Win+H 來調出語音輸入，然後說出你想要的文字，不用在意語音輸入的準確度，只要說出大概的意思就可以了，\n2. 然後全選按下 `CLX+b`，輸入 `列出要点和待辦事項`，就可以看到 AI 自動幫你整理出來的要點和待辦事項。\n\n### 随時翻訳任何語言到任何語言\n\n1. 任何輸入框内，选中你想要翻譯的文字\n2. 然後全選按下 `CLX+b`，`to chinese:` AI 自動幫你輸入成中文。=```\n# CLX - Brainstorm 大腦風暴\n\n任何時間，任何輸入框，按下 `CLX+b` 鍵，開始使用 AI 輔助輸入。\n\n## 按鍵分布（開發中）\n\n| 按鍵描述        | 作用                                                 | 備註 |\n| --------------- | ---------------------------------------------------- | ---- |\n| CLX + b         | 自動複製當前選中內容，輸入指令，讓 AI 輔助你的輸入   |      |\n| CLX + Alt + b   | 配置激活碼（目前只有免費方案，將來可能加入功能增強） |      |\n| CLX + Shift + b | 查查看使用額度                                      |      |\n\n## Protips:\n\n### 隨時整理會議記錄\n\n1. 任何輸入框內，使用 Win+H 來調出語音輸入，然後說出你想要的文字，不用在意語音輸入的準確度，只要說出大概的意思就可以了，\n2. 然後全選按下 `CLX+b`，輸入 `列出要點和待辦事項`，就可以看到 AI 自動幫你整理出來的要點和待辦事項。\n\n### 隨時翻譯任何語言到任何語言\n\n1. 任何輸入框內，選中你想要翻譯的文字\n2. 然後全選按下 `CLX+b`，`to chinese:` AI 自動幫你輸入成中文。\n```
# 编辑增强插件（ TG YUIO HJKL ） 🌟\n\n这个世界上还有比 Vim 模式的 HJKL 移动光标更棒的东西吗？\n这个必须有！\n那就是带加速度的 HJKL 流畅编辑体验！想不想试试让你的光标来一次排水沟过弯的高端操作？装它！\n\n![EditorCursorMovement.gif](./docs/media/EditorCursorMovement.gif)\n\n| 作用域     | Edit 模块             | 说明                             |\n| ---------- | --------------------- | -------------------------------- |\n| 全局(基本) | `CapsLockX + h j k l` | 上下左右 方向键                  |\n| 全局(基本) | `CapsLockX + y o`     | Home End                         |\n| 全局(基本) | `CapsLockX + u i`     | PageUp PageDown                  |\n| 全局(基本) | `CapsLockX + [ ]`     | Shift+Tab 和 Tab                 |\n| 全局(基本) | `CapsLockX + g`       | 回车                             |\n| 全局(进阶) | `CapsLockX + t`       | Delete                           |\n| 全局(进阶) | `CapsLockX + hl`      | hl 一起按选择当前词              |\n| 全局(进阶) | `CapsLockX + kj`      | kj 一起按选择当前行              |\n| 全局(进阶) | `CapsLockX + h + t`   | 移位后删：大部分情况可代替退格键 |=# 編輯增強插件（ TG YUIO HJKL ） 🌟\n\n這個世界上還有比 Vim 模式的 HJKL 移動光標更棒的東西嗎？ 這個必須有！ 那就是帶加速度的 HJKL 流暢編輯體驗！想不想試試讓你的光標來一次排水溝過彎的高端操作？裝它！\n\n| 作用域     | Edit 模組             | 說明                             |\n| ---------- | --------------------- | -------------------------------- |\n| 全局(基本) | `CapsLockX + h j k l` | 上下左右 方向鍵                  |\n| 全局(基本) | `CapsLockX + y o`     | Home End                         |\n| 全局(基本) | `CapsLockX + u i`     | PageUp PageDown                  |\n| 全局(基本) | `CapsLockX + [ ]`     | Shift+Tab 和 Tab                 |\n| 全局(基本) | `CapsLockX + g`       | 回車                             |\n| 全局(進階) | `CapsLockX + t`       | Delete                           |\n| 全局(進階) | `CapsLockX + hl`      | hl 一起按選擇當前詞              |\n| 全局(進階) | `CapsLockX + kj`      | kj 一起按選擇當前行              |\n| 全局(進階) | `CapsLockX + h + t`   | 移位後刪：大部分情況可代替退格鍵 |
# Surface 笔记本扩充功能键\n\n专治各种笔记本残破键盘\n\n1. 没有右 Ctrl 键？合并 Menu 与 右 Ctrl 键，Menu 当 Ctrl 用 或者 Ctrl 当 Menu 用都可以\n2. 没有 Pause 键？Win + Alt + P 也能打开系统设定信息。\n3. 待补充\n\n| 模式             | 按键                                  | 功能                               |\n| ---------------- | :------------------------------------ | ---------------------------------- |\n| 全局             | Win + Alt + P                         | 相当于 Win + Pause，专为笔记本定制 |\n| 全局             | 右 Ctrl 按一下                        | 会按一下 Menu 弹出菜单             |\n| 全局             | 按住右 Menu                           | 会按住 Ctrl，此时可以与其它键组合  |\n| Win 键模拟启用后 | ] 按住同时，[ 按下                    | 相当于按 Win 键                    |\n| Win 键模拟启用后 | RAlt+\\| 相当于按 Alt+Tab 只不过在右手 |=# Surface 筆記本擴充功能鍵\n\n專治各種筆記本殘破鍵盤\n\n1. 沒有右 Ctrl 鍵？合併 Menu 與 右 Ctrl 鍵，Menu 當 Ctrl 用 或者 Ctrl 當 Menu 用都可以\n2. 沒有 Pause 鍵？Win + Alt + P 也能打開系統設定信息。\n3. 待補充\n\n| 模式             | 按鍵                                  | 功能                               |\n| ---------------- | :------------------------------------ | ---------------------------------- |\n| 全局             | Win + Alt + P                         | 相當於 Win + Pause，專為筆記本定製 |\n| 全局             | 右 Ctrl 按一下                        | 會按一下 Menu 彈出菜單             |\n| 全局             | 按住右 Menu                           | 會按住 Ctrl，此時可以與其他鍵組合  |\n| Win 鍵模擬啟用後 | ] 按住同時，[ 按下                    | 相當於按 Win 鍵                    |\n| Win 鍵模擬啟用後 | RAlt+\\| 相當於按 Alt+Tab 只不過在右手 |
# 媒体键模块\n\n| 作用于 | 媒体键模块        | 说明                                        |\n| ------ | ----------------- | ------------------------------------------- |\n| 全局   | `CapsLockX + F1`  | 打开：我的电脑                              |\n| 全局   | `CapsLockX + F2`  | 打开：计算器                                |\n| 全局   | `CapsLockX + F3`  | 打开：浏览器主页                            |\n| 全局   | `CapsLockX + F4`  | 打开：媒体库（默认是 Windows Media Player） |\n| 全局   | `CapsLockX + F5`  | 播放：暂停/播放                             |\n| 全局   | `CapsLockX + F6`  | 播放：上一首                                |\n| 全局   | `CapsLockX + F7`  | 播放：下一首                                |\n| 全局   | `CapsLockX + F8`  | 播放：停止                                  |\n| 全局   | `CapsLockX + F9`  | 音量加                                      |\n| 全局   | `CapsLockX + F10` | 音量减                                      |\n| 全局   | `CapsLockX + F11` | 静音                                        |=# 媒體鍵模組\n\n| 作用於 | 媒體鍵模組        | 說明                                        |\n| ------ | ----------------- | ------------------------------------------- |\n| 全局   | `CapsLockX + F1`  | 打開：我的電腦                              |\n| 全局   | `CapsLockX + F2`  | 打開：計算器                                |\n| 全局   | `CapsLockX + F3`  | 打開：瀏覽器主頁                            |\n| 全局   | `CapsLockX + F4`  | 打開：媒體庫（默認是 Windows Media Player）|\n| 全局   | `CapsLockX + F5`  | 播放：暫停/播放                             |\n| 全局   | `CapsLockX + F6`  | 播放：上一首                                |\n| 全局   | `CapsLockX + F7`  | 播放：下一首                                |\n| 全局   | `CapsLockX + F8`  | 播放：停止                                  |\n| 全局   | `CapsLockX + F9`  | 音量加                                      |\n| 全局   | `CapsLockX + F10` | 音量減                                      |\n| 全局   | `CapsLockX + F11` | 靜音                                        |
# OneNote 2016 - 2019 增强\n\n朴素地增强 OneNote 2016 - 2019 的键盘操作，便捷地使用键盘来：换笔，制作链接，整理页面，调整视图……\n\n## 雪星喵常用功能\n\n1. 做日志的时候，先在笔记页面 `Alt + T` 给笔记标题添加日期标签（用于将来搜索），然后全局 `Win + Shift + N` 在 OneNote 搜索带有 今日标签 的所有笔记，用来方便地检索你今日的：恋爱日记、训练日志、每日书单、项目日报……总之在 OneNote 写日记就很方便了，一按就出来，不用找 XD\n2. 选一个词按 `Alt + K` ，会把所有相关的页面链接列到这个词的下方，用来做索引目录，把你的 OneNote 织成一张网。\n3. 新建一个笔记，改名叫 `我的剪贴板`，然后在复制文本、图片的时候，CLX 会帮你自动追加到这个笔记，用于方便地收集资料或摘抄文章。\n4. Alt + 1234567 层级折叠，轻松地在不同抽象层次的思考上切换。\n\n## 按键分布设计（开发中）\n\n| 按键描述                | 作用                    | 备注       |\n| ----------------------- | ----------------------- | ---------- |\n| `所有 OneNote 自带热键` | 原功能                  |            |\n| `按一下 Alt 再按别的`   | 触发 OneNote 原菜单功能 |            |\n| `Alt + 1234567`         | 大纲折叠展开到 1-7 层级 |            |\n| `Alt + qwe asd r`       | 工具、换笔、视图        |            |\n| `Alt + f`               | 查找标签                |            |\n| `Alt + -\e`              | 公式相关                |            |\n| `Alt + m`               | 移动笔记、分区          |            |\n| `Alt + hjkl`            | 各种链接功能            |            |\n| `Alt + zxcv`            | 高级复制粘贴            | 细节开发中 |\n| `Alt + /`               | 热键帮助、提示          | 开发中     |\n| `F2 F3`                 | 重命名、查找笔记        |            |\n\n## 详细按键表 / CheatSheet\n\n| 作用于                   | 格式热键                     | 功能                                                                      |\n| ------------------------ | ---------------------------- | ------------------------------------------------------------------------- |\n| 全局                     | `Win + Alt + N`              | 打开快速笔记第一页（弥补 OneNote 原本没有像 Notion 一样的首页概念的不足） |\n| 全局                     | `Win + Shift + N`            | 打开 OneNote 并精确搜索今日标签                                           |\n| OneNote2019              | `Alt + 1234567`              | 大纲：大纲折叠展开到那层（强烈推荐，超好用）                              |\n| OneNote2019              | `F2`                         | 整理：重命名笔记                                                          |\n| OneNote2019              | `Shift + F2`                 | 整理：重命名分区                                                          |\n| OneNote2019              | `Alt + m`                    | 整理：移动笔记                                                            |\n| OneNote2019              | `Alt + Shift + m`            | 整理：移动分区                                                            |\n| OneNote2019              | `Ctrl + n`                   | 整理：新建笔记                                                            |\n| OneNote2019              | `Ctrl + Alt + n`             | 整理：在当前笔记下方新建笔记                                              |\n| OneNote2019              | `Alt + Delete`               | 整理：快速删除当前页面                                                    |\n| OneNote2019              | `Ctrl + s`                   | 整理：立即同步此笔记本                                                    |\n| OneNote2019              | `Ctrl + w`                   | 整理：关闭窗口                                                            |\n| OneNote2019              | `Shift + Delete`             | 编辑：快速删除当前行                                                      |\n| OneNote2019              | `Alt + -`                    | 编辑：自动 2 维化公式                                                     |\n| OneNote2019              | `Alt + k`                    | 编辑：⭐🔗 展开当前关键词的相关页面链接（快速关键词一对多链接）           |\n| OneNote2019              | `Alt + n`                    | 样式：切换页面为无色背景                                                  |\n| OneNote2019              | `Alt + v`                    | 样式：改变文字背景色                                                      |\n| OneNote2019              | `Alt + q`                    | 工具：拖动                                                                |\n| OneNote2019              | `Alt + w`                    | 工具：套锁                                                                |\n| OneNote2019              | `Alt + e`                    | 工具：橡皮                                                                |\n| OneNote2019              | `Alt + s`                    | 工具：输入                                                                |\n| OneNote2019              | `Alt + a`                    | 工具：换到第 2 支笔                                                       |\n| OneNote2019              | `Alt + d`                    | 工具：打开换笔盘（然后可可方向键选笔 （目前全屏无效）                     |\n| OneNote2019              | `Alt + d -> 1234567`         | 工具：打开换笔盘（然后选第 1 行第 x 支笔） （目前全屏无效）               |\n| OneNote2019              | `Alt + d -> Shift + 1234567` | 工具：打开换笔盘（然后选第 2 行第 x 支笔） （目前全屏无效）               |\n| OneNote2019              | `Alt + r`                    | 视图：缩放到原始大小                                                      |\n| OneNote2019              | `Alt + y`                    | 视图：缩放到页面宽度                                                      |\n| OneNote2019              | `^!+- 或 ^!+\e`               | 视图：缩小页面 或 放大页面                                                |\n| OneNote2019              | `Alt + f`                    | 视图：搜索标记                                                            |\n| OneNote2019              | `Alt + t`                    | 编辑：给笔记增加日期标签，例如： (20220717)                               |\n| OneNote2019              | `Ctrl + Shift + c`           | 编辑：复制（纯文本）                                                      |\n| OneNote2019              | `Ctrl + Shift + v`           | 编辑：粘贴（纯文本）                                                      |\n| OneNote2019 创建链接窗口 | `Alt + s`                    | 编辑：复制当前所有搜索结果页面的链接                                      |\n| OneNote2019 创建链接窗口 | `Alt + Shift + s`            | 编辑：复制当前所有搜索结果页面的链接并粘贴                                |\n| OneNote2019 剪贴板笔记   | `Ctrl + C`                   | 编辑：⭐ 追加复制的内容到名称中含有 "Clipboard" 或 "剪贴板" 的笔记        |=>>> 輸出：\n\n# OneNote 2016 - 2019 增強\n\n樸素地增強 OneNote 2016 - 2019 的鍵盤操作，便捷地使用鍵盤來：換筆，製作鏈接，整理頁面，調整視圖……\n\n## 雪星喵常用功能\n\n1. 做日誌的時候，先在筆記頁面 `Alt + T` 給筆記標題添加日期標籤（用於將來搜索），然後全局 `Win + Shift + N` 在 OneNote 搜索帶有 今日標籤 的所有筆記，用來方便地檢索你今日的：戀愛日記、訓練日志、每日書單、項目日報……總之在 OneNote 寫日記就很方便了，一按就出來，不用找 XD\n2. 選一個詞按 `Alt + K` ，會把所有相關的頁面鏈接列到這個詞的下方，用來做索引目錄，把你的 OneNote 織成一張網。\n3. 新建一個筆記，改名叫 `我的剪貼板`，然後在複製文本、圖片的時候，CLX 會幫你自動追加到這個筆記，用於方便地收集資料或摘抄文章。\n4. Alt + 1234567 階層折疊，輕松地在不同抽象層次的思考上切換。\n\n## 按鍵分布設計（開發中）\n\n| 按鍵描述                | 作用                    | 備註       |\n| ----------------------- | ----------------------- | ---------- |\n| `所有 OneNote 自帶熱鍵` | 原功能                  |            |\n| `按一下 Alt 再按別的`   | 觸發 OneNote 原菜單功能 |            |\n| `Alt + 1234567`         | 大綱折疊展開到 1-7 階層 |            |\n| `Alt + qwe asd r`       | 工具、換筆、視圖        |            |\n| `Alt + f`               | 查找標籤                |            |\n| `Alt + -\e`              | 公式相關                |            |\n| `Alt + m`               | 移動筆記、分區          |            |\n| `Alt + hjkl`            | 各種鏈接功能            |            |\n| `Alt + zxcv`            | 高級複製粘貼            | 細節開發中 |\n| `Alt + /`               | 熱鍵幫助、提示          | 開發中     |\n| `F2 F3`                 | 重命名、查找筆記        |            |\n\n## 詳細按鍵表 / CheatSheet\n\n| 作用于                   | 格式熱鍵                     | 功能
# JavaScript 计算 (建议安装 NodeJS )\n\n| 作用于 | 按键            | 效果                                   |\n| ------ | --------------- | -------------------------------------- |\n| 全局   | `CapsLockX + -` | 计算当前选区 JavaScript 表达式，并替换 |\n| 全局   | `CapsLockX + \e` | 计算当前选区 JavaScript 表达式，并替换 |=| 作用於 | 按鍵             | 效果                                   |\n| ------ | --------------- | -------------------------------------- |\n| 全局   | `CapsLockX + -` | 計算當前選區 JavaScript 表達式，並替換 |\n| 全局   | `CapsLockX + \e` | 計算當前選區 JavaScript 表達式，並替換 |
# 快捷输入\n\n| 模式 | 快捷输入 | 说明                                            |\n| ---- | -------- | ----------------------------------------------- |\n| 全局 | `#D#`    | 日期输入：`(20220217)`                          |\n| 全局 | `#T#`    | 时间输入：`(20220217.220717)`                   |\n| 全局 | `#DT#`   | 日期时间输入：`2022-02-17 22:07:33`             |\n| 全局 | `#NPW#`  | 随机输入数字密码如： `7500331260229289`         |\n| 全局 | `#PW#`   | 随机输入数字字母密码如： `yyCTCNYodECTLr2h`     |\n| 全局 | `#WPW#`  | 随机输入数字字母密码如： `FtD5BB1m5H98eY7Y`     |\n| 全局 | `#SPW#`  | 随机输入数字字母符号密码如： `/})y+xK]z~>XKQ+p` |=| 模式 | 快捷输入 | 說明                                            |\n| ---- | -------- | ----------------------------------------------- |\n| 全局 | `#D#`    | 日期輸入：`(20220217)`                          |\n| 全局 | `#T#`    | 時間輸入：`(20220217.220717)`                   |\n| 全局 | `#DT#`   | 日期時間輸入：`2022-02-17 22:07:33`             |\n| 全局 | `#NPW#`  | 隨機輸入數字密碼如： `7500331260229289`         |\n| 全局 | `#PW#`   | 隨機輸入數字字母密碼如： `yyCTCNYodECTLr2h`     |\n| 全局 | `#WPW#`  | 隨機輸入數字字母密碼如： `FtD5BB1m5H98eY7Y`     |\n| 全局 | `#SPW#`  | 隨機輸入數字字母符號密碼如： `/})y+xK]z~>XKQ+p` |
# 番茄时钟\n\n25 分钟固定循环休息提醒。\n\n使用 `CapsLockX + ,` 打开配置，然后修改 EnableScheduleTasks\e1 即可启用本插件。\n\n- 使用番茄报时（00 分和 30 分播放工作铃声，每小时的 25 分和 55 分播放休息铃声）（需要先开启定时任务）\n\n  ```ini\n  UseTomatoLife\e1\n  ```\n\n- 使用番茄报时时，自动切换桌面（使用番茄报时时，自动切换桌面（休息桌面为 1，工作桌面为 2）\n\n  ```ini\n  UseTomatoLifeSwitchVirtualDesktop\e1\n  ```\n\n注：如果只需要声音而不需要自动切换桌面的话，也可试试这款 Chrome 插件 [Tomato Life - Chrome 网上应用店](https://chrome.google.com/webstore/detail/25min-tomato-life/kkacpbmkhbljebmpcopjlgfgbgeokbhn)\n\n注注: 本插件已经分离出一个独立项目，如果你喜欢番茄工作法的话可以参见雪星的 tomato-life 项目： [snomiao/tomato-life](https://github.com/snomiao/tomato-life)=# 番茄鐘\n\n25 分鐘固定循環休息提醒。\n\n使用 `CapsLockX + ,` 開啟配置，然後修改 EnableScheduleTasks\e1 即可啟用本插件。\n\n- 使用番茄報時（00 分和 30 分播放工作鈴聲，每小時的 25 分和 55 分播放休息鈴聲）（需要先開啟定時任務）\n\n  ```ini\n  UseTomatoLife\e1\n  ```\n\n- 使用番茄報時時，自動切換桌面（使用番茄報時時，自动切换桌面（休息桌面為 1，工作桌面為 2）\n\n  ```ini\n  UseTomatoLifeSwitchVirtualDesktop\e1\n  ```\n\n注：如果只需要聲音而不需要自动切换桌面的话，也可試試這款 Chrome 插件 [Tomato Life - Chrome 網上應用店](https://chrome.google.com/webstore/detail/25min-tomato-life/kkacpbmkhbljebmpcopjlgfgbgeokbhn)\n\n注注: 本插件已經分離出一個獨立項目，如果你喜歡番茄工作法的話可以參見雪星的 tomato-life 項目： [snomiao/tomato-life](https://github.com/snomiao/tomato-life)
# 锁屏自动息屏\n\n按 Win + L 锁屏时，立即关闭屏幕，适用于准备睡觉的时候自动把电脑屏幕关掉，不让它在睡觉的时候刺眼……\n按 Win + Alt + L 立即关闭屏幕，适用于准备睡觉的时候把电脑屏幕关掉，不让它在睡觉的时候刺眼……=按 Win + L 鎖屏時，立即關閉屏幕，適用於準備睡覺的時候自動把電腦屏幕關掉，不讓它在睡覺的時候刺眼……\n按 Win + Alt + L 立即關閉屏幕，適用於準備睡覺的時候把電腦屏幕關掉，不讓它在睡覺的時候刺眼……
# 模拟鼠标插件（ WASD QERF ）\n\n> 一直以来，我总是以键盘控自居，应该是在从前做模型的时候伤到了手指关节开始，成为键盘重度用户的。各种键盘加速工具，主动去记住各种快捷键，力求少用鼠标，甚至去学习了 vim 和 emacs。但是，很多时候，鼠标是无可替代的，尤其是在图形界面大行其道时候。\n\n—— 以上是来自 [SimClick 模拟点击](https://github.com/rywiki/simclick) 作者的一段话，这是一款以网格细分方式模拟鼠标的作品，可以与本项目互补\n\n—— 由 [秦金伟](http://rsytes.coding-pages.com/) 推荐\n\n## 功能\n\n- 本模块使用按键区：CapsLockX + QWER ASDF\n- 非常舒适地使用 WASD QE RF 来模拟【完整的】鼠标功能，相信我，试过这种手感之后，你会喜欢上它的。\n- 指针移动时会自动黏附各种按钮、超链接。滚轮的指数级增长的加速度滚动机制使你再也不惧怕超级长的文章和网页。\n- 效果如图：\n  ![CLX-Mouse.gif](./docs/media/CLX-Mouse.gif)\n\n## 使用方法如下\n\n| 作用于 | 按键                                  | 说明                                     |\n| ------ | ------------------------------------- | ---------------------------------------- |\n| 全局   | `CapsLockX + w a s d`                 | 鼠标移动（上下左右）                     |\n| 全局   | `CapsLockX + ad`                      | 将 HJKL 键切换到滚轮模式（上下左右滚动） |\n| 全局   | `CapsLockX + r f`                     | 垂直滚轮（上下）                         |\n| 全局   | `CapsLockX + Shift + r f`             | 水平滚轮（左右）                         |\n| 全局   | `CapsLockX + Ctrl + Alt + r f`        | 垂直滚轮自动滚动（上 下）                |\n| 全局   | `CapsLockX + Ctrl + Alt + Shift+ r f` | 水平滚轮自动滚动（左 右）                |\n| 全局   | `CapsLockX + rf`                      | rf 同时按相当于鼠标中键                  |\n| 全局   | `CapsLockX + e`                       | 鼠标左键                                 |\n| 全局   | `CapsLockX + q`                       | 鼠标右键                                 |\n\n## 操作细节\n\n快速连按 AD 步进=```\n# 模擬鼠標插件（ WASD QERF ）\n\n一直以來，我總是以鍵盤控自居，應該是在從前做模型的時候傷到了手指關節開始，成為鍵盤重度用戶的。各種鍵盤加速工具，主動去記住各種快捷鍵，力求少用鼠標，甚至去學習了 vim 和 emacs。但是，很多時候，鼠標是無可替代的，尤其是在圖形界面大行其道時候。\n\n—— 以上是來自 [SimClick 模擬點擊](https://github.com/rywiki/simclick) 作者的一段話，這是一款以網格細分方式模擬鼠標的作品，可以與本項目互補\n\n—— 由 [秦金偉](http://rsytes.coding-pages.com/) 推薦\n\n## 功能\n\n- 本模塊使用按鍵區：CapsLockX + QWER ASDF\n- 非常舒適地使用 WASD QE RF 來模擬【完整的】鼠標功能，相信我，試過這種手感之後，你會喜歡上它的。\n- 指針移動時會自動黏附各種按鈕、超鏈接。滾輪的指數級增長的加速度滾動機制使你再也不懼怕超級長的文章和網頁。\n- 效果如圖：\n  ![CLX-Mouse.gif](./docs/media/CLX-Mouse.gif)\n\n## 使用方法如下\n\n| 作用於 | 按鍵                                  | 說明                                     |\n| ------ | ------------------------------------- | ---------------------------------------- |\n| 全局   | `CapsLockX + w a s d`                 | 鼠標移動（上下左右）                     |\n| 全局   | `CapsLockX + ad`                      | 將 HJKL 鍵切換到滾輪模式（上下左右滾動） |\n| 全局   | `CapsLockX + r f`                     | 垂直滾輪（上下）                         |\n| 全局   | `CapsLockX + Shift + r f`             | 水平滾輪（左右）                         |\n| 全局   | `CapsLockX + Ctrl + Alt + r f`        | 垂直滾輪自動滾動（上 下）                |\n| 全局   | `CapsLockX + Ctrl + Alt + Shift+ r f` | 水平滾輪自動滾動（左 右）                |\n| 全局   | `CapsLockX + rf`                      | rf 同時按相當於鼠標中鍵                  |\n| 全局   | `CapsLockX + e`                       | 鼠標左鍵                                 |\n| 全局   | `CapsLockX + q`                       | 鼠標右鍵                                 |\n\n## 操作細節\n\n快速連按 AD 步進\n```
# 窗口增强插件 (CLX + 1234567890 ZXCV)\n\n## 功能简述\n\n用好 Win 10 自带的 10 个虚拟桌面豪华配置、多显示器自动排列窗口、半透明置顶、（注：任务栏和 AltTab 相关功能暂不兼容 Win11，窗口排列功能正常。）\n\n1. 窗口切换：`CapsLockX + [Shift] + Z`\n2. 窗口关闭：`CapsLockX + [Shift] + X`\n3. 窗口排列：`CapsLockX + [Shift] + C`\n4. 窗口置顶：`CapsLockX + [Shift] + V`\n5. 左手窗口管理：在 `Alt + Tab` 的界面，用 `WASD` 切换窗口，`X` 关掉窗口。\n6. 高效使用虚拟桌面：`CapsLockX + 0123456789` 切换、增减虚拟桌面，加上 `Shift` 键可以转移当前窗口\n7. 虚拟机与远程桌面快速脱离：双击左边 `Shift + Ctrl + Alt`。\n\n## 效果图\n\n- Alt + Tab 管理窗口增强\n  ![02-插件-窗口增强_Alt+Tab+WASD管理窗口.gif](./02-插件-窗口增强_Alt+Tab+WASD管理窗口.gif)\n- CapsLockX + C 一键排列窗口（这 GIF 是旧版本录的看起来比较卡，新版本优化过 API 就不卡了）\n  ![02-插件-窗口增强_一键排列窗口.gif](./docs/media/02-插件-窗口增强_一键排列窗口.gif)\n\n## 使用方法如下 ( Alt+Tab 与 CapsLockX )\n\n| 作用域       | 窗口增强模块                          | 说明                                       |\n| ------------ | ------------------------------------- | ------------------------------------------ |\n| Alt+Tab 界面 | `Q E`                                 | 左右切换多桌面                             |\n| Alt+Tab 界面 | `W A S D`                             | 上下左右切换窗口选择                       |\n| Alt+Tab 界面 | `X C`                                 | 关闭选择的窗口（目前 X 和 C 没有区别）     |\n| Win+Tab 视图 | `Alt + W A S D`                       | 切换窗口选择                               |\n| 全局         | `Win + [Shift] + B`                   | 定位到托盘任务(windows 系統自帯熱鍵)       |\n| 全局         | `Win + [Shift] + T`                   | 定位到任務栏任务(windows 系統自帯熱鍵)     |\n| 全局         | `Win + Shift + hjkl`                  | 在窗口之间按方向切换焦点                   |\n| 任务栏       | `Ctrl + W 或 Delete`                  | 在托盘图标或任务栏任务上，选择退出按钮     |\n| 全局         | `CapsLockX + 1 2 ... 9 0`             | 切换到第 1 .. 12 个桌面                    |\n| 全局         | `CapsLockX + Shift + 1 2 ... 9 0 - \e` | 把当前窗口移到第 n 个桌面(如果有的话)      |\n| 全局         | `CapsLockX + Alt + Backspace`         | 删除当前桌面（会把所有窗口移到上一个桌面） |\n| 全局         | `CapsLockX + C`                       | 快速排列当前桌面的窗口                     |\n| 全局         | `CapsLockX + Ctrl + C`                | 快速排列当前桌面的窗口（包括最小化的窗口） |\n| 全局         | `CapsLockX + Shift + C`               | 快速堆叠当前桌面的窗口                     |\n| 全局         | `CapsLockX + Shift + Ctrl + C`        | 快速堆叠当前桌面的窗口（包括最小化的窗口） |\n| 全局         | `CapsLockX + Z`                       | 循环切到最近使用的窗口                     |\n| 全局         | `CapsLockX + Shift + Z`               | 循环切到最不近使用的窗口                   |\n| 全局         | `CapsLockX + X`                       | 关掉当前标签页 Ctrl+W                      |\n| 全局         | `CapsLockX + Shift + X`               | 关掉当前窗口 Alt+F4                        |\n| 全局         | `CapsLockX + V`                       | 让窗口透明                                 |\n| 全局         | `CapsLockX + Shift + V`               | 让窗口保持透明（并置顶）                   |\n| 任意窗口     | `双击左边 Shift+Ctrl+Alt`             | 后置当前窗口， \\* 见下方注                 |\n\n\\*注： 双击左边 Shift+Ctrl+Alt 设计用于远程桌面与虚拟机，使其可与本机桌面窗口同时显示。\n例如 mstsc.exe、TeamViewer、VirtualBox、HyperV、VMWare 等远程桌面或虚拟机程序，配合 CapsLockX + Shift + V 透明置顶功能，让你在 Windows 的界面上同时使用 Linux 界面或 MacOS 界面再也不是难题。\n\n此处借用 [@yangbin9317 的评论](https://v2ex.com/t/772052#r_10458792)\n\n> 以 CapsLock 为抓手,打通底层逻辑,拉齐 Windows 和 Linux WM,解决了 Windows 难用的痛点\n\n(20220313) 对于两端都是 Windows 的情况，也可以考虑使用 [RemoteApp Tool - Kim Knight](http://www.kimknight.net/remoteapptool) 来代替远程桌面。=```\n# 窗口增強插件 (CLX + 1234567890 ZXCV)\n\n## 功能簡述\n\n用好 Win 10 自帶的 10 個虛擬桌面豪華配置、多顯示器自動排列窗口、半透明置頂、（注：任務欄和 AltTab 相關功能暫不兼容 Win11，窗口排列功能正常。）\n\n1. 窗口切換：`CapsLockX + [Shift] + Z`\n2. 窗口關閉：`CapsLockX + [Shift] + X`\n3. 窗口排列：`CapsLockX + [Shift] + C`\n4. 窗口置頂：`CapsLockX + [Shift] + V`\n5. 左手窗口管理：在 `Alt + Tab` 的界面，用 `WASD` 切換窗口，`X` 關掉窗口。\n6. 高效使用虛擬桌面：`CapsLockX + 0123456789` 切換、增減虛擬桌面，加上 `Shift` 鍵可以轉移當前窗口\n7. 虛擬機與遠程桌面快速脫離：雙擊左邊 `Shift + Ctrl + Alt`。\n\n## 效果圖\n\n- Alt + Tab 管理窗口增強\n  ![02-插件-窗口增強_Alt+Tab+WASD管理窗口.gif](./02-插件-窗口增強_Alt+Tab+WASD管理窗口.gif)\n- CapsLockX + C 一鍵排列窗口（這 GIF 是舊版本錄的看起來比較卡，新版本優化過 API 就不卡了）\n  ![02-插件-窗口增強_一鍵排列窗口.gif](./docs/media/02-插件-窗口增強_一鍵排列窗口.gif)\n\n## 使用方法如下 ( Alt+Tab 與 CapsLockX )\n\n| 作用域       | 窗口增強模塊                          | 說明                                       |\n| ------------ | ------------------------------------- | ------------------------------------------ |\n| Alt+Tab 界面 | `Q E`                                 | 左右切換多桌面                             |\n| Alt+Tab 界面 | `W A S D`                             | 上下左右切換窗口選擇                       |\n| Alt+Tab 界面 | `X C`                                 | 關閉選擇的窗口（目前 X 和 C 沒有區別）     |\n| Win+Tab 視圖 | `Alt + W A S D`                       | 切換窗口選擇                               |\n| 全局         | `Win + [Shift] + B`                   | 定位到托盤任務(windows 系統自帶熱鍵)       |\n| 全局         | `Win + [Shift] + T`                   | 定位到任務欄任務(windows 系統自帶熱鍵)     |\n| 全局         | `Win + Shift + hjkl`                  | 在窗口之間按方向切換焦點                   |\n| 任務欄       | `Ctrl + W 或 Delete`                  | 在托盤圖標或任務欄任務上，選擇退出按鈕     |\n| 全局         | `CapsLockX + 1 2 ... 9 0`             | 切換到第 1 .. 12 個桌面                    |\n| 全局         | `CapsLockX + Shift + 1 2 ... 9 0 - \e` | 把當前窗口移到第 n 個桌面(如果有的話)      |\n| 全局         | `CapsLockX + Alt + Backspace`         | 刪除當前桌面（會把所有窗口移到上一個桌面） |\n| 全局         | `CapsLockX + C`                       | 快速排列當前桌面的窗口                     |\n| 全局         | `CapsLockX + Ctrl + C`                | 快速排列當前桌面的窗口（包括最小化的窗口） |\n| 全局         | `CapsLockX + Shift + C`               | 快速堆疊當前桌面的窗口                     |\n| 全局         | `CapsLockX + Shift + Ctrl + C`        | 快速堆疊當前桌面的窗口（包括最小化的窗口） |\n| 全局         | `CapsLockX + Z`                       | 循環切到最近使用的窗口                     |\n| 全局         | `CapsLockX + Shift + Z`               | 循環切到最不近使用的窗口                   |\n| 全局         | `CapsLockX + X`                       | 關掉當前標籤頁 Ctrl+W                      |\n| 全局         | `CapsLockX + Shift + X`               | 關掉當前窗口 Alt+F4                        |\n| 全局         | `CapsLockX + V`                       | 讓窗口透明                                 |\n| 全局         | `CapsLockX + Shift + V`               | 讓窗口保持透明（並置頂）                   |\n| 任意窗口     | `雙擊左邊 Shift+Ctrl+Alt`             | 後置當前窗口， \\* 見下方注                 |\n\n\\*注： 雙擊左邊 Shift+Ctrl+Alt 設計用於遠程桌面與虛擬機，使其可與本機桌面窗口同時顯示。\n例如 mstsc.exe、TeamViewer、VirtualBox、HyperV、VMWare 等遠程桌面或虛擬機程序，配合 CapsLockX + Shift + V 透明置頂功能，讓你在 Windows 的界面上同時使用 Linux 界面或 MacOS 界面再也不是難題。\n\n此處借用 [@yangbin9317 的評論](https://v2ex.com/t/772052#r_10458792)\n\n> 以 CapsLock 為抓手,打通底層邏輯,拉齊 Windows 和 Linux WM,解決了 Windows 難用的痛點\n\n(20220313) 對於兩端都是 Windows 的情況，也可以考慮使用 [RemoteApp Tool - Kim Knight](http://www.kimknight.net/remoteapptool) 來代替遠程桌面。\n```
设置Windows自动启动=設定Windows自動啟動
